Documents/ESB/ESB_Consumer_0712/003TestSample/SAMPLE_XML_MUST/DepositAccount/DA19_NostroAcctOpnRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/DepositAccount/NostroAcctOpnRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DepositAccount</ServiceDomain>  
      <OperationName>NostroAcctOpn</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:NostroAcctOpnRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DA19</v11:TxnId>  
        <v11:TxnNo>DA1900001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <v11:NostroAcctId>601086</v11:NostroAcctId>  
        <v11:CustPermId>999999</v11:CustPermId>  
        <v11:ProdCode>6010</v11:ProdCode>  
        <v11:Ccy>TWD</v11:Ccy>  
        <!--Optional:-->  
        <v11:ReconAcct>Y</v11:ReconAcct>  
        <!--Optional:-->  
        <v11:CntngntIntrstType>B</v11:CntngntIntrstType> 
      </v11:ServiceBody> 
    </v11:NostroAcctOpnRq> 
  </soap:Body> 
</soap:Envelope>
